RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_flexio.h
    base->TIMCFG[index] = reg;
}

/*! @} */

/*!
 * @name FlexIO Interrupt Operation
 * @{
 */

/*!
 * @brief Enables the shifter status interrupt. The interrupt generates when the corresponding SSF is set.
 *
 * @param base FlexIO peripheral base address
 * @param mask The shifter status mask which can be calculated by (1 << shifter index)
 * @note For multiple shifter status interrupt enable, for example, two shifter status enable, can calculate
 * the mask by using ((1 << shifter index0) | (1 << shifter index1))
 */
static inline void FLEXIO_EnableShifterStatusInterrupts(FLEXIO_Type *base, uint32_t mask)
{
    base->SHIFTSIEN |= mask;
}

/*!
 * @brief Disables the shifter status interrupt. The interrupt won't generate when the corresponding SSF is set.
 *
 * @param base FlexIO peripheral base address
 * @param mask The shifter status mask which can be calculated by (1 << shifter index)
 * @note For multiple shifter status interrupt enable, for example, two shifter status enable, can calculate
 * the mask by using ((1 << shifter index0) | (1 << shifter index1))
 */
static inline void FLEXIO_DisableShifterStatusInterrupts(FLEXIO_Type *base, uint32_t mask)
{
    base->SHIFTSIEN &= ~mask;
}

/*!
 * @brief Enables the shifter error interrupt. The interrupt generates when the corresponding SEF is set.
 *
 * @param base FlexIO peripheral base address
 * @param mask The shifter error mask which can be calculated by (1 << shifter index)
 * @note For multiple shifter error interrupt enable, for example, two shifter error enable, can calculate
 * the mask by using ((1 << shifter index0) | (1 << shifter index1))
 */
static inline void FLEXIO_EnableShifterErrorInterrupts(FLEXIO_Type *base, uint32_t mask)
{
    base->SHIFTEIEN |= mask;
}

/*!
 * @brief Disables the shifter error interrupt. The interrupt won't generate when the corresponding SEF is set.
 *
 * @param base FlexIO peripheral base address
 * @param mask The shifter error mask which can be calculated by (1 << shifter index)
 * @note For multiple shifter error interrupt enable, for example, two shifter error enable, can calculate
 * the mask by using ((1 << shifter index0) | (1 << shifter index1))
 */
static inline void FLEXIO_DisableShifterErrorInterrupts(FLEXIO_Type *base, uint32_t mask)
{
    base->SHIFTEIEN &= ~mask;
}

/*!
 * @brief Enables the timer status interrupt. The interrupt generates when the corresponding SSF is set.
 *
 * @param base FlexIO peripheral base address
 * @param mask The timer status mask which can be calculated by (1 << timer index)
 * @note For multiple timer status interrupt enable, for example, two timer status enable, can calculate
 * the mask by using ((1 << timer index0) | (1 << timer index1))
 */
static inline void FLEXIO_EnableTimerStatusInterrupts(FLEXIO_Type *base, uint32_t mask)
{
    base->TIMIEN |= mask;
}

/*!
 * @brief Disables the timer status interrupt. The interrupt won't generate when the corresponding SSF is set.
 *
 * @param base FlexIO peripheral base address
 * @param mask The timer status mask which can be calculated by (1 << timer index)
 * @note For multiple timer status interrupt enable, for example, two timer status enable, can calculate
 * the mask by using ((1 << timer index0) | (1 << timer index1))
 */
static inline void FLEXIO_DisableTimerStatusInterrupts(FLEXIO_Type *base, uint32_t mask)
{
    base->TIMIEN &= ~mask;
}

/*! @} */

/*!
 * @name FlexIO Status Operation
 * @{
 */

/*!
 * @brief Gets the shifter status flags.
 *
 * @param base FlexIO peripheral base address
 * @return Shifter status flags
 */
static inline uint32_t FLEXIO_GetShifterStatusFlags(FLEXIO_Type *base)
{
    return ((base->SHIFTSTAT) & FLEXIO_SHIFTSTAT_SSF_MASK);
}

/*!
 * @brief Clears the shifter status flags.
 *
 * @param base FlexIO peripheral base address
 * @param mask The shifter status mask which can be calculated by (1 << shifter index)
 * @note For clearing multiple shifter status flags, for example, two shifter status flags, can calculate
 * the mask by using ((1 << shifter index0) | (1 << shifter index1))
 */
static inline void FLEXIO_ClearShifterStatusFlags(FLEXIO_Type *base, uint32_t mask)
{
    base->SHIFTSTAT = mask;
}

/*!
 * @brief Gets the shifter error flags.
 *
 * @param base FlexIO peripheral base address
 * @return Shifter error flags
 */
static inline uint32_t FLEXIO_GetShifterErrorFlags(FLEXIO_Type *base)
{
    return ((base->SHIFTERR) & FLEXIO_SHIFTERR_SEF_MASK);
}

/*!
 * @brief Clears the shifter error flags.
 *
 * @param base FlexIO peripheral base address
 * @param mask The shifter error mask which can be calculated by (1 << shifter index)
 * @note For clearing multiple shifter error flags, for example, two shifter error flags, can calculate
 * the mask by using ((1 << shifter index0) | (1 << shifter index1))
 */
static inline void FLEXIO_ClearShifterErrorFlags(FLEXIO_Type *base, uint32_t mask)
{
    base->SHIFTERR = mask;
}

/*!
 * @brief Gets the timer status flags.
 *
 * @param base FlexIO peripheral base address
 * @return Timer status flags
 */
static inline uint32_t FLEXIO_GetTimerStatusFlags(FLEXIO_Type *base)
{
    return ((base->TIMSTAT) & FLEXIO_TIMSTAT_TSF_MASK);
}

/*!
 * @brief Clears the timer status flags.
 *
 * @param base FlexIO peripheral base address
 * @param mask The timer status mask which can be calculated by (1 << timer index)
 * @note For clearing multiple timer status flags, for example, two timer status flags, can calculate
 * the mask by using ((1 << timer index0) | (1 << timer index1))
 */
static inline void FLEXIO_ClearTimerStatusFlags(FLEXIO_Type *base, uint32_t mask)
{
    base->TIMSTAT = mask;
}

/*! @} */

/*!
 * @name FlexIO DMA Operation
 * @{
 */

/*!
 * @brief Enables/disables the shifter status DMA. The DMA request  generates when the corresponding SSF is set.
 *
 * @note For multiple shifter status DMA enables, for example, calculate
 * the mask by using ((1 << shifter index0) | (1 << shifter index1))
 *
 * @param base FlexIO peripheral base address
 * @param mask The shifter status mask which can be calculated by (1 << shifter index)
 * @param enable True to enable, false to disable.
 */
static inline void FLEXIO_EnableShifterStatusDMA(FLEXIO_Type *base, uint32_t mask, bool enable)
{
    if (enable)
    {
        base->SHIFTSDEN |= mask;
    }
    else
    {
        base->SHIFTSDEN &= ~mask;
    }
}

/*!
 * @brief Gets the shifter buffer address for the DMA transfer usage.
 *
 * @param base FlexIO peripheral base address
 * @param type Shifter type of flexio_shifter_buffer_type_t
 * @param index Shifter index
 * @return Corresponding shifter buffer index
 */
uint32_t FLEXIO_GetShifterBufferAddress(FLEXIO_Type *base, flexio_shifter_buffer_type_t type, uint8_t index);

/*!
 * @brief Registers the handle and the interrupt handler for the FlexIO-simulated peripheral.
 *
 * @param base Pointer to the FlexIO simulated peripheral type.
 * @param handle Pointer to the handler for FlexIO simulated peripheral.
 * @param isr FlexIO simulated peripheral interrupt handler.
 * @retval kStatus_Success Successfully create the handle.
 * @retval kStatus_OutOfRange The FlexIO type/handle/ISR table out of range.
 */
status_t FLEXIO_RegisterHandleIRQ(void *base, void *handle, flexio_isr_t isr);

/*!
 * @brief Unregisters the handle and the interrupt handler for the FlexIO-simulated peripheral.
 *
 * @param base Pointer to the FlexIO simulated peripheral type.
 * @retval kStatus_Success Successfully create the handle.
 * @retval kStatus_OutOfRange The FlexIO type/handle/ISR table out of range.
 */
status_t FLEXIO_UnregisterHandleIRQ(void *base);
/*! @} */

#if defined(FSL_FEATURE_FLEXIO_HAS_PIN_REGISTER) && FSL_FEATURE_FLEXIO_HAS_PIN_REGISTER

/*!
 * @brief Configure a FLEXIO pin used by the board.
 *
 * To Config the FLEXIO PIN, define a pin configuration, as either input or output, in the user file.
 * Then, call the FLEXIO_SetPinConfig() function.
 *
 * This is an example to define an input pin or an output pin configuration.
 * @code
 * Define a digital input pin configuration,
 * flexio_gpio_config_t config =
 * {
 *   kFLEXIO_DigitalInput,
 *   0U,
 *   kFLEXIO_FlagRisingEdgeEnable | kFLEXIO_InputInterruptEnable,
 * }
 * Define a digital output pin configuration,
 * flexio_gpio_config_t config =
 * {
 *   kFLEXIO_DigitalOutput,
 *   0U,
 *   0U
 * }
 * @endcode
 * @param base   FlexIO peripheral base address
 * @param pin    FLEXIO pin number.
 * @param config FLEXIO pin configuration pointer.
 */
void FLEXIO_SetPinConfig(FLEXIO_Type *base, uint32_t pin, flexio_gpio_config_t *config);

/*!
 * @name GPIO Output Operations
 * @{
 */

/*!
 * @brief Sets the output level of the multiple FLEXIO pins to the logic 0.
 *
 * @param base   FlexIO peripheral base address
 * @param mask   FLEXIO pin number mask
 */
static inline void FLEXIO_ClearPortOutput(FLEXIO_Type *base, uint32_t mask)
{
    base->PINOUTCLR = mask;
}

/*!
 * @brief Sets the output level of the multiple FLEXIO pins to the logic 1.
 *
 * @param base   FlexIO peripheral base address
 * @param mask   FLEXIO pin number mask
 */
static inline void FLEXIO_SetPortOutput(FLEXIO_Type *base, uint32_t mask)
{
    base->PINOUTSET = mask;
}

/*!
 * @brief Reverses the current output logic of the multiple FLEXIO pins.
 *
 * @param base   FlexIO peripheral base address
 * @param mask   FLEXIO pin number mask
 */
static inline void FLEXIO_TogglePortOutput(FLEXIO_Type *base, uint32_t mask)
{
    base->PINOUTTOG = mask;
}

/*!
 * @brief Sets the output level of the FLEXIO pins to the logic 1 or 0.
 *
 * @param base    FlexIO peripheral base address
 * @param pin     FLEXIO pin number.
 * @param output  FLEXIO pin output logic level.
 *        - 0: corresponding pin output low-logic level.
 *        - 1: corresponding pin output high-logic level.
 */
static inline void FLEXIO_PinWrite(FLEXIO_Type *base, uint32_t pin, uint8_t output)
{
    if (output == 0U)
    {
        FLEXIO_ClearPortOutput(base, 1UL << pin);
    }
    else
    {
        FLEXIO_SetPortOutput(base, 1UL << pin);
    }
}

/*!
 * @brief Enables the FLEXIO output pin function.
 *
 * @param base   FlexIO peripheral base address
 * @param pin    FLEXIO pin number.
 */
static inline void FLEXIO_EnablePinOutput(FLEXIO_Type *base, uint32_t pin)
{
    base->PINOUTE |= (1UL << pin);
}
/*! @} */

/*!
 * @name FLEXIO PIN Input Operations
 * @{
 */

/*!
 * @brief  Reads the current input value of the FLEXIO pin.
 *
 * @param base   FlexIO peripheral base address
 * @param pin    FLEXIO pin number.
 * @retval FLEXIO port input value
 *        - 0: corresponding pin input low-logic level.
 *        - 1: corresponding pin input high-logic level.
 */
static inline uint32_t FLEXIO_PinRead(FLEXIO_Type *base, uint32_t pin)
{
    return (((base->PIN) >> pin) & 0x01U);
}

/*!
 * @brief Gets the FLEXIO input pin status.
 *
 * @param base   FlexIO peripheral base address
 * @param pin    FLEXIO pin number.
 * @retval FLEXIO port input status
 *        - 0: corresponding pin input capture no status.
 *        - 1: corresponding pin input capture rising or falling edge.
 */
static inline uint32_t FLEXIO_GetPinStatus(FLEXIO_Type *base, uint32_t pin)
{
    return (((base->PINSTAT) >> pin) & 0x01U);
}

/*!
 * @brief Sets the FLEXIO output pin level.
 *
 * @param base   FlexIO peripheral base address
 * @param pin    FlexIO pin number.
 * @param level  FlexIO output pin level to set, can be either 0 or 1.
 */
static inline void FLEXIO_SetPinLevel(FLEXIO_Type *base, uint8_t pin, bool level)
{
	base->PINOUTD =
		(base->PINOUTD & ~((uint32_t)((uint32_t)1U << pin))) |
		(FLEXIO_PINOUTD_OUTD((uint32_t)((true == level)
		? (uint32_t)0x1U : (uint32_t)0x0U) << pin));
}

/*!
 * @brief Gets the enabled status of a FLEXIO output pin.
 *
 * @param base   FlexIO peripheral base address
 * @param pin    FlexIO pin number.
 * @retval       FlexIO port enabled status
 *        - 0: corresponding output pin is in disabled state.
 *        - 1: corresponding output pin is in enabled state.
 */
static inline bool FLEXIO_GetPinOverride(const FLEXIO_Type *const base, uint8_t pin)
{
	return ((base->PINOUTE & (uint32_t)((uint32_t)1U << pin)) != 0UL);
}

/*!
 * @brief Enables or disables a FLEXIO output pin.
 *
 * @param base     FlexIO peripheral base address
 * @param pin      Flexio pin number.
 * @param enabled  Enable or disable the FlexIO pin.
 */
static inline void FLEXIO_ConfigPinOverride(FLEXIO_Type *base, uint8_t pin, bool enabled)
{
	base->PINOUTE =
		(base->PINOUTE & ~((uint32_t)((uint32_t)1U << pin))) |
		FLEXIO_PINOUTE_OUTE((uint32_t)((true == enabled)
		? (uint32_t)0x1U : (uint32_t)0x0U) << pin);
}

/*!
 * @brief Clears the multiple FLEXIO input pins status.
 *
 * @param base   FlexIO peripheral base address
 * @param mask   FLEXIO pin number mask
 */
static inline void FLEXIO_ClearPortStatus(FLEXIO_Type *base, uint32_t mask)
{
    base->PINSTAT = mask;
}
/*! @} */

#endif /*FSL_FEATURE_FLEXIO_HAS_PIN_REGISTER*/

#if defined(__cplusplus)
}
#endif /*_cplusplus*/
/*! @} */

#endif /*FSL_FLEXIO_H_*/
